tests/UKHO.ERPFacade.API.FunctionalTests/ERPFacadeExpectedXmlFiles/S57ExpectedXmlFiles/CellMetadataChangeWithNewCell.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Z_ADDS_MAT_INFO xmlns="urn:sap-com:document:sap:rfc:functions">
      <IM_MATINFO xmlns="">
        <CORRID>62d4c8a3-56f1-4f4f-d35d-08dcd31236c8</CORRID>
        <NOOFACTIONS>2</NOOFACTIONS>
        <RECDATE>20240920</RECDATE>
        <RECTIME>015038</RECTIME>
        <ORG>UKHO</ORG>
        <ACTIONITEMS>
          <item>
            <ACTIONNUMBER>1</ACTIONNUMBER>
            <ACTION>CHANGE ENC CELL</ACTION>
            <PRODUCT>ENC CELL</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>US5AK1XQ</CHILDCELL>
            <PRODUCTNAME>US5AK1XQ</PRODUCTNAME>
            <CANCELLED />
            <REPLACEDBY />
            <AGENCY>US</AGENCY>
            <PROVIDER>1</PROVIDER>
            <ENCSIZE>medium</ENCSIZE>
            <TITLE />
            <EDITIONNO />
            <UPDATENO />
            <UNITTYPE />
            <WEEKNO>202431</WEEKNO>
            <VALIDFROM>20240801</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY />
            <NEXTKEY />
          </item>
          <item>
            <ACTIONNUMBER>2</ACTIONNUMBER>
            <ACTION>CHANGE AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL></CHILDCELL>
            <PRODUCTNAME>US5AK1XQ</PRODUCTNAME>
            <CANCELLED />
            <REPLACEDBY />
            <AGENCY>US</AGENCY>
            <PROVIDER>1</PROVIDER>
            <ENCSIZE>medium</ENCSIZE>
            <TITLE />
            <EDITIONNO />
            <UPDATENO />
            <UNITTYPE />
            <WEEKNO>202431</WEEKNO>
            <VALIDFROM>20240801</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY />
            <NEXTKEY />
          </item>
        </ACTIONITEMS>
      </IM_MATINFO>
    </Z_ADDS_MAT_INFO>
  </soap:Body>
</soap:Envelope>